[
    {
      "name": "crashpal-dfw",
      "isInternal": true,
      "path": "crashpal-dfw",
      "srcType": "photo",
      "src": "assets/img/news/news-pic-1.jpeg",
      "headline": "Overall Parts Solutions (OPS) Launches the Connected Accident Advisor APP",
      "byline": "Chrysler, Dodge, Jeep®, Ram, FIAT and ALFA ROMEO vehicle owners will be the first to experience the all-new feature",
      "author": "CrashPal",
      "date": "2021-06-24",
      "content": "<p>GRAND PRAIRIE, Texas (June 24, 2021) — Overall Parts Solutions (OPS), a leader in automotive software solutions, announces the release of CrashPalTM, a no-cost mobile application designed to help create an effortless customer experience for first notice of loss after a collision.</p></br> <p>“OPS’ goal is to create an innovative end-to-end solution for our customers. A vehicle collision can be a pain point in vehicle ownership. When a driver has been in an accident, it can be hard for the driver to focus on the next steps,” said Sib Bahjat, COO and co-founder of OPS. “The CrashPalTM app streamlines and simplifies the documentation process after an accident. With the app on their smartphones, drivers will have post-collision guidance to help protect against unnecessary worries and provide peace of mind.”</p></br> <p>Available through Chrysler, Dodge, Jeep®, Ram, FIAT and ALFA ROMEO mobile apps, CrashPalTM allows drivers to store their personal information, such as their driver’s license and insurance information, so it is readily available when needed. In the event of a road accident, the driver accesses the CrashPalTM app, which messages the driver to make sure all passengers are okay and if needed to dial 9-1-1 immediately. The driver is prompted to turn on their hazard lights and move to a safe spot if possible. It then assists the driver through the entire post-accident damage process to ensure they capture photos of the vehicle damage, which can be shared with the driver’s insurance company, along with pertinent information from others involved with the accident.</p> </br> <p>CrashPalTM makes it easy to request towing service and have the vehicle towed directly to a Chrysler, Dodge, Jeep®, Ram, FIAT and ALFA ROMEO Certified Collision Center where the vehicle can be repaired, adhering to safety standards. Through the app, the driver can also arrange for a ride home via connected ride share companies.</p> </br> <p>CrashPalTM is a no-cost feature to Chrysler, Dodge, Jeep®, Ram, FIAT and ALFA ROMEO owners.</p>  </br> <h5>ABOUT OVERALL PARTS SOLUTIONS (OPS)</h5> </br> <p>Overall Parts Solutions (OPS) is headquartered in Grand Prairie, TX and is the national category leader in automotive repair parts solutions for the past 25 years. The company provides customized, innovative technology to enhance performance, productivity, and profitability in the auto collision and mechanical repair sector.  Its state-of-the-art OPSTrax parts management and delivery system have been adopted by the majority of MSOs and parts throughout North America.</p>",
      "isPrivate": false
    }
  ]
